#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()//<< >> 只能作用于整数
//{//  /得到的是商 %得到的是余数
//	int a = 5 / 2;//商2余1
//	double b = 5 / 2.0;//除数和被除数必须有一个是浮点型
//	//对于%两个操作符必须是整数
//	printf("a=%d\nb=%lf", a,b);
//	return 0;
//}

//int main()//<< >> 只能作用于整数
//{//算术右移，大部分见到的是算术右移
//	//右移有除二的效果
//	int a = 16;
//	a >> 1;//右移操作符
//	//移动的是二进制位
//	//000000000000000000010000
//	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}//正整数的原码，反码，补码是相同的。
//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001  -原码
//	//11111111111111111111111111111110  -反码
//	//11111111111111111111111111111111 - 补码
//	return 0;
//}
//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	printf("b=%d\n", b);
//	return 0;
//}

//int main()//只能作用于整数 & | ^
//{
//	/*int a = 3;
//	int b = 5;
//	int c = a & b;
//	printf("%d\n", c);*/
//	/*int a = 3;
//	int b = 5;
//	int c = a | b;
//	printf("%d\n", c);*/
//	int a = 3;
//	int b = 4;
//	int c = a ^ b;
//	printf("%d\n", c);
//	return 0;
//}//与：全一则一 或：有一则一 异或：有一则一全一则零

